pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr6043.h
/* SDHSCTL3 Control Bits */
#define TRIGEN                           (0x0001)        /* SDHS Trigger Enable bit */
#define TRIGEN_L                         (0x0001)
#define TRIGEN_0                         (0x0000)        /* SDHS Trigger is disabled. Once this bit is de-asserted, CTL0, 
                                                            CTL1, CTL2, CTL7,WINHITH, WINLOTH, and DTCDA registers are 
                                                            unlocked (allowed to be modified). */
#define TRIGEN_1                         (0x0001)        /* SDHS Trigger is enabled. Once this bit is asserted, CTL0,  
                                                            CTL1, CTL2, CTL7,WINHITH, WINLOTH, and DTCDA registers are 
                                                            locked (not allowed to be modified). */
#define TRIGEN_1_L                       (0x0001)

/* SDHSCTL4 Control Bits */
#define SDHSON                           (0x0001)        /* SDHS Power-up */
#define SDHSON_L                         (0x0001)
#define SDHSON_0                         (0x0000)        /* Power down the SDHS module */
#define SDHSON_1                         (0x0001)        /* Power on the SDHS module */
#define SDHSON_1_L                       (0x0001)

/* SDHSCTL5 Control Bits */
#define SSTART                           (0x0001)        /* Start of conversion. */
#define SSTART_L                         (0x0001)
#define SSTART_0                         (0x0000)        /* Stop conversion */
#define SSTART_1                         (0x0001)        /* Start conversion */
#define SSTART_1_L                       (0x0001)
#define SDHS_LOCK                        (0x0100)        /* Start of conversion. */
#define SDHS_LOCK_H                      (0x0001)
#define SDHS_LOCK_0                      (0x0000)        /* CTL3 register is unlocked. */
#define SDHS_LOCK_1                      (0x0100)        /* CTL3 register is locked as well as  CTL0,  CTL1, CTL2, 
                                                            CTL7,WINHITH, WINLOTH, and DTCDA registers. Only read is 
                                                            allowed. */
#define SDHS_LOCK_1_H                    (0x0001)

/* SDHSCTL6 Control Bits */
#define PGA_GAIN                         (0x003f)        /* PGA Gain Control bits */
#define PGA_GAIN_L                       (0x003f)
#define PGA_GAIN0                        (0x0001)        /* PGA Gain Control bits */
#define PGA_GAIN0_L                      (0x0001)
#define PGA_GAIN1                        (0x0002)        /* PGA Gain Control bits */
#define PGA_GAIN1_L                      (0x0002)
#define PGA_GAIN2                        (0x0004)        /* PGA Gain Control bits */
#define PGA_GAIN2_L                      (0x0004)
#define PGA_GAIN3                        (0x0008)        /* PGA Gain Control bits */
#define PGA_GAIN3_L                      (0x0008)
#define PGA_GAIN4                        (0x0010)        /* PGA Gain Control bits */
#define PGA_GAIN4_L                      (0x0010)
#define PGA_GAIN5                        (0x0020)        /* PGA Gain Control bits */
#define PGA_GAIN5_L                      (0x0020)

/* SDHSCTL7 Control Bits */
#define MODOPTI                          (0x001f)        /* SDHS Modulator Optimization bits. */
#define MODOPTI_L                        (0x001f)
#define MODOPTI0                         (0x0001)        /* SDHS Modulator Optimization bits. */
#define MODOPTI0_L                       (0x0001)
#define MODOPTI1                         (0x0002)        /* SDHS Modulator Optimization bits. */
#define MODOPTI1_L                       (0x0002)
#define MODOPTI2                         (0x0004)        /* SDHS Modulator Optimization bits. */
#define MODOPTI2_L                       (0x0004)
#define MODOPTI3                         (0x0008)        /* SDHS Modulator Optimization bits. */
#define MODOPTI3_L                       (0x0008)
#define MODOPTI4                         (0x0010)        /* SDHS Modulator Optimization bits. */
#define MODOPTI4_L                       (0x0010)

/* SDHSWINHITH Control Bits */
#define WINHITH                          (0xffff)        /* SDHS Window Comparator High Threshold Register. */
#define WINHITH_L                        (0x00ff)
#define WINHITH_H                        (0x00ff)
#define WINHITH0                         (0x0001)        /* SDHS Window Comparator High Threshold Register. */
#define WINHITH0_L                       (0x0001)
#define WINHITH1                         (0x0002)        /* SDHS Window Comparator High Threshold Register. */
#define WINHITH1_L                       (0x0002)
#define WINHITH2                         (0x0004)        /* SDHS Window Comparator High Threshold Register. */
#define WINHITH2_L                       (0x0004)
#define WINHITH3                         (0x0008)        /* SDHS Window Comparator High Threshold Register. */
#define WINHITH3_L                       (0x0008)
#define WINHITH4                         (0x0010)        /* SDHS Window Comparator High Threshold Register. */
#define WINHITH4_L                       (0x0010)
#define WINHITH5                         (0x0020)        /* SDHS Window Comparator High Threshold Register. */
#define WINHITH5_L                       (0x0020)
#define WINHITH6                         (0x0040)        /* SDHS Window Comparator High Threshold Register. */
#define WINHITH6_L                       (0x0040)
#define WINHITH7                         (0x0080)        /* SDHS Window Comparator High Threshold Register. */
#define WINHITH7_L                       (0x0080)
#define WINHITH8                         (0x0100)        /* SDHS Window Comparator High Threshold Register. */
#define WINHITH8_H                       (0x0001)
#define WINHITH9                         (0x0200)        /* SDHS Window Comparator High Threshold Register. */
#define WINHITH9_H                       (0x0002)
#define WINHITH10                        (0x0400)        /* SDHS Window Comparator High Threshold Register. */
#define WINHITH10_H                      (0x0004)
#define WINHITH11                        (0x0800)        /* SDHS Window Comparator High Threshold Register. */
#define WINHITH11_H                      (0x0008)
#define WINHITH12                        (0x1000)        /* SDHS Window Comparator High Threshold Register. */
#define WINHITH12_H                      (0x0010)
#define WINHITH13                        (0x2000)        /* SDHS Window Comparator High Threshold Register. */
#define WINHITH13_H                      (0x0020)
#define WINHITH14                        (0x4000)        /* SDHS Window Comparator High Threshold Register. */
#define WINHITH14_H                      (0x0040)
#define WINHITH15                        (0x8000)        /* SDHS Window Comparator High Threshold Register. */
#define WINHITH15_H                      (0x0080)

/* SDHSWINLOTH Control Bits */
#define WINLOTH                          (0xffff)        /* SDHS Window Comparator Low Threshold Register. */
#define WINLOTH_L                        (0x00ff)
#define WINLOTH_H                        (0x00ff)
#define WINLOTH0                         (0x0001)        /* SDHS Window Comparator Low Threshold Register. */
#define WINLOTH0_L                       (0x0001)
#define WINLOTH1                         (0x0002)        /* SDHS Window Comparator Low Threshold Register. */
#define WINLOTH1_L                       (0x0002)
#define WINLOTH2                         (0x0004)        /* SDHS Window Comparator Low Threshold Register. */
#define WINLOTH2_L                       (0x0004)
#define WINLOTH3                         (0x0008)        /* SDHS Window Comparator Low Threshold Register. */
#define WINLOTH3_L                       (0x0008)
#define WINLOTH4                         (0x0010)        /* SDHS Window Comparator Low Threshold Register. */
#define WINLOTH4_L                       (0x0010)
#define WINLOTH5                         (0x0020)        /* SDHS Window Comparator Low Threshold Register. */
#define WINLOTH5_L                       (0x0020)
#define WINLOTH6                         (0x0040)        /* SDHS Window Comparator Low Threshold Register. */
#define WINLOTH6_L                       (0x0040)
#define WINLOTH7                         (0x0080)        /* SDHS Window Comparator Low Threshold Register. */
#define WINLOTH7_L                       (0x0080)
#define WINLOTH8                         (0x0100)        /* SDHS Window Comparator Low Threshold Register. */
#define WINLOTH8_H                       (0x0001)
#define WINLOTH9                         (0x0200)        /* SDHS Window Comparator Low Threshold Register. */
#define WINLOTH9_H                       (0x0002)
#define WINLOTH10                        (0x0400)        /* SDHS Window Comparator Low Threshold Register. */
#define WINLOTH10_H                      (0x0004)
#define WINLOTH11                        (0x0800)        /* SDHS Window Comparator Low Threshold Register. */
#define WINLOTH11_H                      (0x0008)
#define WINLOTH12                        (0x1000)        /* SDHS Window Comparator Low Threshold Register. */
#define WINLOTH12_H                      (0x0010)
#define WINLOTH13                        (0x2000)        /* SDHS Window Comparator Low Threshold Register. */
#define WINLOTH13_H                      (0x0020)
#define WINLOTH14                        (0x4000)        /* SDHS Window Comparator Low Threshold Register. */
#define WINLOTH14_H                      (0x0040)
#define WINLOTH15                        (0x8000)        /* SDHS Window Comparator Low Threshold Register. */
#define WINLOTH15_H                      (0x0080)

/* SDHSDTCDA Control Bits */
#define DTCDA                            (0x7fff)        /* DTC destination address. */
#define DTCDA_L                          (0x00ff)
#define DTCDA_H                          (0x007f)
#define DTCDA0                           (0x0001)        /* DTC destination address. */
#define DTCDA0_L                         (0x0001)
#define DTCDA1                           (0x0002)        /* DTC destination address. */
#define DTCDA1_L                         (0x0002)
#define DTCDA2                           (0x0004)        /* DTC destination address. */
#define DTCDA2_L                         (0x0004)
#define DTCDA3                           (0x0008)        /* DTC destination address. */
#define DTCDA3_L                         (0x0008)
#define DTCDA4                           (0x0010)        /* DTC destination address. */
#define DTCDA4_L                         (0x0010)
#define DTCDA5                           (0x0020)        /* DTC destination address. */
#define DTCDA5_L                         (0x0020)
#define DTCDA6                           (0x0040)        /* DTC destination address. */
#define DTCDA6_L                         (0x0040)
#define DTCDA7                           (0x0080)        /* DTC destination address. */
#define DTCDA7_L                         (0x0080)
#define DTCDA8                           (0x0100)        /* DTC destination address. */
#define DTCDA8_H                         (0x0001)
#define DTCDA9                           (0x0200)        /* DTC destination address. */
#define DTCDA9_H                         (0x0002)
#define DTCDA10                          (0x0400)        /* DTC destination address. */
#define DTCDA10_H                        (0x0004)
#define DTCDA11                          (0x0800)        /* DTC destination address. */
#define DTCDA11_H                        (0x0008)
#define DTCDA12                          (0x1000)        /* DTC destination address. */
#define DTCDA12_H                        (0x0010)
#define DTCDA13                          (0x2000)        /* DTC destination address. */
#define DTCDA13_H                        (0x0020)
#define DTCDA14                          (0x4000)        /* DTC destination address. */
#define DTCDA14_H                        (0x0040)


/*****************************************************************************
 SFR Registers
*****************************************************************************/

#define __MSP430_HAS_SFR__                    /* Definition to show that module is available */
#define __MSP430_BASEADDRESS_SFR__ 0x0100
#define SFR_BASE               __MSP430_BASEADDRESS_SFR__

